# Pandas

# Series

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([10,11,12,13])

In [4]:
obj

0    10
1    11
2    12
3    13
dtype: int64

In [5]:
obj.values

array([10, 11, 12, 13], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
#we can manually set the value of index
obj1 = pd.Series([13,25,56,85],index = ['a','b','c','d'])

In [8]:
obj1

a    13
b    25
c    56
d    85
dtype: int64

In [9]:
obj1['b']

25

In [10]:
obj1['c']=100

In [11]:
obj1['c']

100

In [12]:
obj1['z']=1111
obj1

a      13
b      25
c     100
d      85
z    1111
dtype: int64

In [13]:
del obj1['d']

In [14]:
obj1

a      13
b      25
c     100
z    1111
dtype: int64

In [15]:
index=[1,2,3,4,5,6]

In [16]:
obj2 = pd.Series(["apple","orange","red","green","blue","black"],index=index)

In [17]:
obj2

1     apple
2    orange
3       red
4     green
5      blue
6     black
dtype: object

In [18]:
obj2[5]="brown"

In [19]:
obj2

1     apple
2    orange
3       red
4     green
5     brown
6     black
dtype: object

In [20]:
obj2[7]="yellow"

In [21]:
obj2

1     apple
2    orange
3       red
4     green
5     brown
6     black
7    yellow
dtype: object

In [22]:
del obj2[3]
obj2

1     apple
2    orange
4     green
5     brown
6     black
7    yellow
dtype: object

In [23]:
obj2[[2,5,1]]

2    orange
5     brown
1     apple
dtype: object

In [24]:
obj2 =="black"

1    False
2    False
4    False
5    False
6     True
7    False
dtype: bool

In [25]:
obj2 =="banana"

1    False
2    False
4    False
5    False
6    False
7    False
dtype: bool

In [26]:
obj2[obj2=="brown"]

5    brown
dtype: object

In [27]:
obj2 * 2

1      appleapple
2    orangeorange
4      greengreen
5      brownbrown
6      blackblack
7    yellowyellow
dtype: object

In [28]:
print("apple "*5)

apple apple apple apple apple

In [29]:
s1 = pd.Series([100,200,300,400,500],index = ["hun","2h","3h","4h","5h"])

In [30]:
s1

hun    100
2h     200
3h     300
4h     400
5h     500
dtype: int64

In [31]:
'6h' in s1

False

In [32]:
'3h' in s1

True

# Creating a series using python dictionary

In [33]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [34]:
s2 = pd.Series(sdata)

In [35]:
s2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

# Data Frames

In [36]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [37]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [40]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
       index=['one', 'two', 'three', 'four',
      'five', 'six'])

In [41]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [42]:
frame2['debt'] = [100,200,300,400,500,600]
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   100
two    2001    Ohio  1.7   200
three  2002    Ohio  3.6   300
four   2001  Nevada  2.4   400
five   2002  Nevada  2.9   500
six    2003  Nevada  3.2   600

In [43]:
frame2.debt = range(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [45]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt        2
Name: three, dtype: object

In [46]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [48]:
frame2[["state" , "year"]]

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nevada  2001
five   Nevada  2002
six    Nevada  2003

In [49]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt        2
Name: three, dtype: object

In [50]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [51]:
 frame2['debt'] = val

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
frame2.debt[['one',"three",'six']] = [5,10,15]

E:\anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   5.0
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  10.0
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2  15.0

In [55]:
frame2['eastern'] = frame2.state == 'Ohio'

In [56]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   5.0     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6  10.0     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2  15.0    False

In [57]:
score = {'python1':[78,67,89,90,99,100,56],
         'python2':[67,87,90,98,56,100,89],
         'AI for everyone':[98,78,90,67,76,85,83]}

In [58]:
#sc = pd.DataFrame(score, index["mustafa","ali","noman","nabeel","daniyal","arshad","faisal"])
data = pd.DataFrame(score)

In [59]:
data

   python1  python2  AI for everyone
0       78       67               98
1       67       87               78
2       89       90               90
3       90       98               67
4       99       56               76
5      100      100               85
6       56       89               83

In [60]:
data["total"] = data.python1 + data.python2 + data['AI for everyone']

In [61]:
data

   python1  python2  AI for everyone  total
0       78       67               98    243
1       67       87               78    232
2       89       90               90    269
3       90       98               67    255
4       99       56               76    231
5      100      100               85    285
6       56       89               83    228

In [62]:
data["percentage"] = data["total"]/300 * 100

In [63]:
data

   python1  python2  AI for everyone  total  percentage
0       78       67               98    243   81.000000
1       67       87               78    232   77.333333
2       89       90               90    269   89.666667
3       90       98               67    255   85.000000
4       99       56               76    231   77.000000
5      100      100               85    285   95.000000
6       56       89               83    228   76.000000

In [64]:
 data['Status'] = ["Pass" if i>=250  else "Fails" for i in data.total]

In [65]:
data

   python1  python2  AI for everyone  total  percentage Status
0       78       67               98    243   81.000000  Fails
1       67       87               78    232   77.333333  Fails
2       89       90               90    269   89.666667   Pass
3       90       98               67    255   85.000000   Pass
4       99       56               76    231   77.000000  Fails
5      100      100               85    285   95.000000   Pass
6       56       89               83    228   76.000000  Fails

In [68]:
a=data[["python1","python2","AI for everyone"]]
data["Status2"]=["pass" if all(i>=70) else "fail" for i in data[["python1","python2","AI for everyone"]].values]

In [69]:
data

   python1  python2  AI for everyone  total  percentage Status Status2
0       78       67               98    243   81.000000  Fails    fail
1       67       87               78    232   77.333333  Fails    fail
2       89       90               90    269   89.666667   Pass    pass
3       90       98               67    255   85.000000   Pass    fail
4       99       56               76    231   77.000000  Fails    fail
5      100      100               85    285   95.000000   Pass    pass
6       56       89               83    228   76.000000  Fails    fail